nathanlnw/tw7o5_smsmodem/bsp/stm32f207VC_tw705/app_712/gsm/SMS.c
/*
     SMS.C
*/
#include <rtthread.h>
#include <rthw.h>
#include "stm32f2xx.h"
#include "usart.h"
#include "board.h"
#include <serial.h>

#include  <stdlib.h>//数字转换成字符串
#include  <stdio.h>
#include  <string.h>
#include  "App_moduleConfig.h"
#include  "App_gsm.h"
#include  "SMS.h"


SMS_Style   SMS_Service;    //  短息相关

u8 SMS_Destion[15];   //  发送短息目标号码



/*********************************************************************************
*函数名称:void SMS_timer(u8 *instr,u16 len)
*功能描述:短信处理函数，这个函数需要在一个1秒的定时器里面调用，用于函数"SMS_Process"的定时处理等
*输    入:none
*输    出:none
*返 回 值:none
*作    者:白养民
*创建日期:2013-05-29
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
void SMS_timer(void)
{
    if(SMS_Service.SMS_waitCounter)
        SMS_Service.SMS_waitCounter--;
}


/*********************************************************************************
*函数名称:void SMS_protocol(u8 *instr,u16 len)
*功能描述:短信处理函数，这个函数需要在一个线程里面调用，进行相关处理(短信读取，删除和自动发送相关)
*输    入:none
*输    出:none
*返 回 值:none
*作    者:白养民
*创建日期:2013-05-29
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
void SMS_Process(void)
{
    u16   	ContentLen = 0;
    //	u16 		i,j,k;
    char *pstrTemp;
    if(SMS_Service.SMS_waitCounter)
        return;
    //-----------  短信处理相关 --------------------------------------------------------
    //---------------------------------
    if(SMS_Service.SMS_read)	   // 读取短信
    {
        memset(SMS_Service.SMSAtSend, 0, sizeof(SMS_Service.SMSAtSend));
        /*
        strcpy( ( char * ) SMS_Service.SMSAtSend, "AT+CMGR=" );
        if ( SMS_Service.SMIndex > 9 )
        {
        	SMS_Service.SMSAtSend[8] = ( SMS_Service.SMIndex >> 4 ) + 0x30;
        	SMS_Service.SMSAtSend[9] = ( SMS_Service.SMIndex & 0x0f ) + 0x30;
        	SMS_Service.SMSAtSend[10] = 0x0d;
        	SMS_Service.SMSAtSend[11] = 0x0a;
        }
        else
        {
        	SMS_Service.SMSAtSend[8] = ( SMS_Service.SMIndex & 0x0f ) + 0x30;
        	SMS_Service.SMSAtSend[9] = 0x0d;
        	SMS_Service.SMSAtSend[10] = 0x0a;
        }
        rt_kprintf("\r\n%s",SMS_Service.SMSAtSend);
        */
        ///
        sprintf(SMS_Service.SMSAtSend, "AT+CMGR=%d\r\n", SMS_Service.SMIndex);
        rt_kprintf("%s", SMS_Service.SMSAtSend);
        ///
        rt_hw_gsm_output( ( char * ) SMS_Service.SMSAtSend );
        SMS_Service.SMS_read--;
        SMS_Service.SMS_waitCounter = 3;
    }
    //-------------------------------
    //       发送短息确认
    else if(SMS_Service.SMS_sendFlag == 1)
    {
        //#ifdef SMS_TYPE_PDU
        if(SMS_Service.SMS_come == 1)
        {
            memset(SMS_Service.SMSAtSend, 0, sizeof(SMS_Service.SMSAtSend));
            ///申请400字节空间
            pstrTemp = rt_malloc(400);
            memset(pstrTemp, 0, 400);
            ///将字符串格式的目的电话号码设置为PDU格式的号码
            SetPhoneNumToPDU(SMS_Service.Sms_Info.TPA, SMS_Service.SMS_destNum, sizeof(SMS_Service.Sms_Info.TPA));
            ///生成PDU格式短信内容
            ContentLen = AnySmsEncode_NoCenter(SMS_Service.Sms_Info.TPA, GSM_UCS2, SMS_Service.SMS_sd_Content, strlen(SMS_Service.SMS_sd_Content), pstrTemp);
            //ContentLen=strlen(pstrTemp);
            ///添加短信尾部标记"esc"
            pstrTemp[ContentLen] = 0x1A;    // message  end
            //////
            sprintf( ( char * ) SMS_Service.SMSAtSend, "AT+CMGS=%d\r\n", (ContentLen - 2) / 2);
			  if(GB19056.workstate==3)
            rt_kprintf("%s", SMS_Service.SMSAtSend);
            rt_hw_gsm_output( ( char * ) SMS_Service.SMSAtSend );
            rt_thread_delay(50);
            //////
            //rt_kprintf("%s",pstrTemp);
            if(GB19056.workstate==3)
            rt_device_write( &dev_vuart, 0, pstrTemp, strlen(pstrTemp) );
            rt_hw_gsm_output_Data( ( char * ) pstrTemp, ContentLen + 1);
            rt_free( pstrTemp );
            pstrTemp = RT_NULL;
        }
        //#else
        else
        {
            memset(SMS_Service.SMSAtSend, 0, sizeof(SMS_Service.SMSAtSend));
            strcpy( ( char * ) SMS_Service.SMSAtSend, "AT+CMGS=\"" );
            //strcat(SMS_Service.SMSAtSend,"8613820554863");// Debug
            strcat(SMS_Service.SMSAtSend, SMS_Service.SMS_destNum);
            strcat(SMS_Service.SMSAtSend, "\"\r\n");
               if(GB19056.workstate==3)
            rt_kprintf("\r\n%s", SMS_Service.SMSAtSend);
            rt_hw_gsm_output( ( char * ) SMS_Service.SMSAtSend );

            rt_thread_delay(50);
            ContentLen = strlen(SMS_Service.SMS_sd_Content);
            SMS_Service.SMS_sd_Content	[ContentLen] = 0x1A;    // message  end
          if(GB19056.workstate==3)
            rt_kprintf("%s", SMS_Service.SMS_sd_Content);
            rt_hw_gsm_output_Data( ( char * ) SMS_Service.SMS_sd_Content, ContentLen + 1);
        }
        //#endif
        SMS_Service.SMS_sendFlag = 0; // clear
        SMS_Service.SMS_waitCounter = 3;
    }

}


///增加发送短信区域的内容，并置位发送短息标记，成功返回true，失败返回false
u8 Add_SMS_Ack_Content(char *instr, u8 ACKflag)
{
    if(ACKflag == 0)
        return false;

    if(strlen(instr) + strlen(SMS_Service.SMS_sd_Content) < sizeof(SMS_Service.SMS_sd_Content))
    {
        strcat((char *)SMS_Service.SMS_sd_Content, instr);
        SMS_Service.SMS_sendFlag = 1;
        return true;
    }
    return false;
}

/*********************************************************************************
*函数名称:void SMS_protocol(u8 *instr,u16 len)
*功能描述:接收到短信后参数处理函数
*输    入:instr原始短信数据，len长度
*输    出:none
*返 回 值:none
*作    者:白养民
*创建日期:2013-05-29
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
void   SMS_protocol (u8 *instr, u16 len, u8  ACKstate)  //  ACKstate
{
    char	sms_content[60];		///短信命令区"()"之间的内容
    char	sms_ack_data[60];		///短信每个命令包括'#'符的完整内容
    u8	u8TempBuf[6];
    u16	i = 0, j = 0, res = 0;
    u16  cmdLen, u16Temp;
    char *p_Instr;
    char *pstrTemp, *pstrTempStart, *pstrTempEnd;

