nathanlnw/tw7o5_smsmodem/bsp/stm32f207VC_tw705/app_712/gsm/SMS.c
    /*
        if(SMS_ACK_none==ACKstate)
        {
    		rt_kprintf( "\r\n 收到gprs TXT消息: " );
    		rt_device_write( &dev_vuart, 0, instr, len);
        }
    */

    // 一.  快速设置
    //  TW703#SET#C{津A55555}#V{12345678901234567}#M{0}#S{12345678901}#K{1}
    if(strncmp((char *)instr, "#SET", 4) == 0)
    {
        //  1.  车牌号
        if((instr[5] == 'C') && (instr[6] == '{'))
        {
            memset((u8 *)&Vechicle_Info.Vech_Num, 0, sizeof(Vechicle_Info.Vech_Num));	//clear
            rt_memcpy(Vechicle_Info.Vech_Num, instr + 7, 8);
            DF_WriteFlashSector(DF_Vehicle_Struct_offset, 0, (u8 *)&Vechicle_Info, sizeof(Vechicle_Info));
            WatchDog_Feed();
            DF_WriteFlashSector(DF_VehicleBAK_Struct_offset, 0, (u8 *)&Vechicle_Info, sizeof(Vechicle_Info));

            WatchDog_Feed();
            DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset, 0, (u8 *)&Vechicle_Info, sizeof(Vechicle_Info));
        }

        // 2 .  VIN
        if((instr[17] == 'V') && (instr[18] == '{'))
        {
            memset(sms_content, 0, sizeof(sms_content));
            memcpy(sms_content, instr + 19, 17);
            vin_set(sms_content);
        }
        // 3.  连接模式
        if((instr[38] == 'M') && (instr[39] == '{'))
        {

            // 域名
            memset(DomainNameStr, 0, sizeof(DomainNameStr));
            memset(SysConf_struct.DNSR, 0, sizeof(DomainNameStr));
            if(instr[40] == '0')
            {
                memcpy(DomainNameStr, "jt1.gghypt.net", 14);
                memcpy(SysConf_struct.DNSR, "jt1.gghypt.net", 14);
            }
            else if(instr[40] == '1')
            {
                memcpy(DomainNameStr, "up.gps960.com", 13);
                memcpy(SysConf_struct.DNSR, "up.gps960.com", 13);
            }
            Api_Config_write(config, ID_CONF_SYS, (u8 *)&SysConf_struct, sizeof(SysConf_struct));
            //----- 传给 GSM 模块------
            DataLink_DNSR_Set(SysConf_struct.DNSR, 1);

            // 端口
            if(instr[40] == '0')
            {
                port_main("7008");
            }
            else
            {
                port_main("8201");
            }

        }
        // 4.  SIM卡号  ，手机号码
        if((instr[43] == 'S') && (instr[44] == '{'))
        {
            memset(SimID_12D, '0', sizeof(SimID_12D));
            memcpy(SimID_12D + 1, instr + 45, 11);;
            DF_WriteFlashSector(DF_SIMID_12D, 0, SimID_12D, 13);
            SIMID_Convert_SIMCODE(); //  转换
        }
        //  5. 车辆类型
        if((instr[58] == 'K') && (instr[59] == '{'))
        {
            if(instr[60] == '1')
                type_vech(1);

            else if(instr[60] == '2')
                type_vech(2);



            //------ end process
            if(ACKstate == SMS_ACK_none)
                SD_ACKflag.f_CentreCMDack_0001H = 2 ; //DataLink_EndFlag=1; //AT_End(); 先返回结果再挂断
            else
                DataLink_EndFlag = 1; //AT_End();
            //--------    清除鉴权码 -------------------
            idip("clear");
            password(1);

            memset(SMS_Service.SMS_sd_Content, 0, sizeof(SMS_Service.SMS_sd_Content));
            strcpy(SMS_Service.SMS_sd_Content, "TW705");
            strcat(SMS_Service.SMS_sd_Content, "#");
            strcat(SMS_Service.SMS_sd_Content, "SETOK");
            memcpy(SMS_Service.SMS_sd_Content + strlen(SMS_Service.SMS_sd_Content), instr + 4, 58);
            Add_SMS_Ack_Content("", ACKstate);
        }
        return;
    }

    //  二.  Normal   state

    //SYSID		///修改该值，保存flash
    ///应答短信包头部分
    memset(SMS_Service.SMS_sd_Content, 0, sizeof(SMS_Service.SMS_sd_Content));
    strcpy(SMS_Service.SMS_sd_Content, Vechicle_Info.Vech_Num);
    strcat(SMS_Service.SMS_sd_Content, "#"); // Debug
    strcat(SMS_Service.SMS_sd_Content, SimID_12D); // Debug
    //strcat(SMS_Service.SMS_sd_Content,"#TW705");
    if(Vechicle_Info.Vech_Type_Mark == 1)
        strcat(SMS_Service.SMS_sd_Content, "#K1"); // 版本信息
    else if(Vechicle_Info.Vech_Type_Mark == 2)
        strcat(SMS_Service.SMS_sd_Content, "#H1"); // 版本信息
    else
        strcat(SMS_Service.SMS_sd_Content, "#QT"); // QT 版本信息

    /*************************处理信息****************************/
    p_Instr = (char *)instr;
    for(i = 0; i < len; i++)
    {
        pstrTemp = strchr(p_Instr, '#');					///查找命令是否存在
        //instr++;
        if(pstrTemp)
        {
            p_Instr = pstrTemp + 1;
            pstrTempStart = strchr((char *)pstrTemp, '(');			///查找命令内容开始位置
            pstrTempEnd = strchr((char *)pstrTemp, ')');			///查找命令内容结束位置
            if((NULL == pstrTempStart) || (NULL == pstrTempEnd))
            {
                break;
            }
            if(GB19056.workstate) 
                rt_kprintf("\r\n短信命令格式有效 !");
            ///获取命令内容
            memset(sms_ack_data, 0, sizeof(sms_ack_data));
            memcpy(sms_ack_data, pstrTemp, pstrTempEnd - pstrTemp + 1);

            ///获取命令参数区域的内容以及参数长度
            pstrTempStart++;
            pstrTemp++;
            cmdLen = pstrTempEnd - pstrTempStart;
            memset(sms_content, 0, sizeof(sms_content));
            rt_memcpy(sms_content, pstrTempStart, cmdLen);

            ///进行命令匹配
            if(strncmp(pstrTemp, "DNSR", 4) == 0)				///  1. 设置域名
            {
                if(cmdLen <= sizeof(DomainNameStr))
                {
                    if(pstrTemp[4] == '1')		///主域名
                    {
                        //rt_kprintf("\r\n设置主域名 !");
                        memset(DomainNameStr, 0, sizeof(DomainNameStr));
                        memset(SysConf_struct.DNSR, 0, sizeof(DomainNameStr));
                        memcpy(DomainNameStr, (char *)pstrTempStart, cmdLen);
                        memcpy(SysConf_struct.DNSR, (char *)pstrTempStart, cmdLen);
                        Api_Config_write(config, ID_CONF_SYS, (u8 *)&SysConf_struct, sizeof(SysConf_struct));
                        //----- 传给 GSM 模块------
                        DataLink_DNSR_Set(SysConf_struct.DNSR, 1);

                        ///
                        Add_SMS_Ack_Content(sms_ack_data, ACKstate);

                        //------- add on 2013-6-6
                        if(ACKstate == SMS_ACK_none)
                            SD_ACKflag.f_CentreCMDack_0001H = 2 ; //DataLink_EndFlag=1; //AT_End(); 先返回结果再挂断
                        else
                            DataLink_EndFlag = 1; //AT_End();

                        //--------    清除鉴权码 -------------------
                        idip("clear");

