nathanlnw/tw7o5_smsmodem/bsp/stm32f207VC_tw705/app_712/gsm/SMS.c
                    }
                    else if(pstrTemp[2] == '2')
                    {
                        memcpy(SysConf_struct.IP_Aux, u8TempBuf, 4);
                        memcpy(RemoteIP_aux, u8TempBuf, 4);
                        SysConf_struct.Port_Aux = RemotePort_aux;
                        Api_Config_write(config, ID_CONF_SYS, (u8 *)&SysConf_struct, sizeof(SysConf_struct));
                        //rt_kprintf("\r\n短信设置备用服务器 IP: %d.%d.%d.%d : %d ",RemoteIP_aux[0],RemoteIP_aux[1],RemoteIP_aux[2],RemoteIP_aux[3],RemotePort_aux);
                        //-----------  Below add by Nathan  ----------------------------
                        DataLink_AuxSocket_set(RemoteIP_aux, RemotePort_aux, 1);
                        ///
                        Add_SMS_Ack_Content(sms_ack_data, ACKstate);
                    }
                }
            }
            if(strncmp(pstrTemp, "MODE", 4) == 0)			///6. 设置定位模式
            {
                if(strncmp(sms_content, "BD", 2) == 0)
                {
                    gps_mode("1");
                }
                if(strncmp(sms_content, "GP", 2) == 0)
                {
                    gps_mode("2");
                }
                if(strncmp(sms_content, "GN", 2) == 0)
                {
                    gps_mode("3");
                }
                Add_SMS_Ack_Content(sms_ack_data, ACKstate);
            }
            else if(strncmp(pstrTemp, "VIN", 3) == 0)				///7.设置车辆VIN
            {
                vin_set(sms_content);
                Add_SMS_Ack_Content(sms_ack_data, ACKstate);
            }
            else if(strncmp(pstrTemp, "TIREDCLEAR", 10) == 0)		///8.清除疲劳驾驶记录
            {
                index_write(0x11, 0);
                Add_SMS_Ack_Content(sms_ack_data, ACKstate);
            }
            else if(strncmp(pstrTemp, "SPDLIMIT", 8) == 0)		///8+1.清除疲劳驾驶记录
            {
                Limit_max_SateFlag = sms_content[0] - 0x30;
                DF_WriteFlashSector(DF_LimitSPEED_offset, 0, &Limit_max_SateFlag, 1);
                Add_SMS_Ack_Content(sms_ack_data, ACKstate);
            }
            else if(strncmp(pstrTemp, "DISCLEAR", 8) == 0)			///9清除里程
            {
                DayStartDistance_32 = 0;
                Distance_m_u32 = 0;
                //              Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
                DF_Write_RecordAdd(Distance_m_u32, DayStartDistance_32, TYPE_DayDistancAdd);
                JT808Conf_struct.DayStartDistance_32 = DayStartDistance_32;
                JT808Conf_struct.Distance_m_u32 = Distance_m_u32;
                Add_SMS_Ack_Content(sms_ack_data, ACKstate);
            }
            else if(strncmp(pstrTemp, "SPDCLEAR", 8) == 0) //  超速报警清除
            {
#ifdef SPD_WARN_SAVE
                //-----  Record update----
                ExpSpdRec_write = 0;
                ExpSpdRec_write = 0;
                DF_Write_RecordAdd(ExpSpdRec_write, ExpSpdRec_write, TYPE_ExpSpdAdd);
#endif

                Add_SMS_Ack_Content(sms_ack_data, ACKstate);

            }
            else if(strncmp(pstrTemp, "RESET", 5) == 0)			///10.终端重启
            {
                reset();
            }
            else if(strncmp(pstrTemp, "RELAY", 5) == 0)			///11.继电器控制
            {
                if(sms_content[0] == '0')
                    debug_relay("0");
                if(sms_content[0] == '1')
                    debug_relay("1");

                Add_SMS_Ack_Content(sms_ack_data, ACKstate);
            }
            else if(strncmp(pstrTemp, "TAKE", 4) == 0)				//12./拍照
            {
                switch(sms_content[0])
                {
                case '1':
                    takephoto("1");
                    break;
                case '2':
                    takephoto("2");
                    break;
                case '3':
                    takephoto("3");
                    break;
                case '4':
                    takephoto("4");
                    break;
                }
                Add_SMS_Ack_Content(sms_ack_data, ACKstate);
            }
            else if(strncmp(pstrTemp, "PLAY", 4) == 0)				///13.语音播报
            {
                TTS_Get_Data(sms_content, strlen(sms_content));
                Add_SMS_Ack_Content(sms_ack_data, ACKstate);
            }
            else if(strncmp(pstrTemp, "QUERY", 5) == 0)			///14.车辆状态查询
            {
                switch(sms_content[0])
                {
                case '0':  // 终端号  主域名  主端口

                    strcat((char *)SMS_Service.SMS_sd_Content, sms_ack_data);
                    strcat(SMS_Service.SMS_sd_Content, "#"); // 分隔符号
                    strcat(SMS_Service.SMS_sd_Content, DeviceNumberID); // 终端ID
                    strcat(SMS_Service.SMS_sd_Content, "#"); // 分隔符号
                    strcat(SMS_Service.SMS_sd_Content, DomainNameStr); // 分隔符号
                    strcat(SMS_Service.SMS_sd_Content, "#"); // 分隔符号
                    sprintf(SMS_Service.SMS_sd_Content + strlen(SMS_Service.SMS_sd_Content), "%d", RemotePort_main);

                    break;
                case '1':  // MODE    主IP   主端口
                    strcat((char *)SMS_Service.SMS_sd_Content, sms_ack_data);
                    strcat(SMS_Service.SMS_sd_Content, "#"); // 分隔符号
                    if(Vechicle_Info.Link_Frist_Mode == 1)
                        strcat(SMS_Service.SMS_sd_Content, "MODE(mainlink)");
                    else
                        strcat(SMS_Service.SMS_sd_Content, "MODE(dnsr)");
                    strcat(SMS_Service.SMS_sd_Content, "#"); // 分隔符号
                    IP_Str(SMS_Service.SMS_sd_Content + strlen(SMS_Service.SMS_sd_Content), *( u32 * ) RemoteIP_main);
                    strcat(SMS_Service.SMS_sd_Content, "#"); // 分隔符号
                    sprintf(SMS_Service.SMS_sd_Content + strlen(SMS_Service.SMS_sd_Content), "%d", RemotePort_main);

                    break;
                case '2':
                    strcat(SMS_Service.SMS_sd_Content, "#"); // 分隔符号
                    strcat(SMS_Service.SMS_sd_Content, Posit_ASCII.Lat_ASCII); // 分隔符号
                    strcat(SMS_Service.SMS_sd_Content, "#"); // 分隔符号
                    strcat(SMS_Service.SMS_sd_Content, Posit_ASCII.Longi_ASCII); // 分隔符号
                    strcat(SMS_Service.SMS_sd_Content, "#"); // 分隔符号
                    strcat(SMS_Service.SMS_sd_Content, &Posit_ASCII.AV_ASCII); // 分隔符号
                    strcat(SMS_Service.SMS_sd_Content, "#"); // 分隔符号
                    if(GpsStatus.Position_Moule_Status == 1)
                    {
                        strcat(SMS_Service.SMS_sd_Content, "BD");
                    }
                    else if(GpsStatus.Position_Moule_Status == 2)
                    {
                        strcat(SMS_Service.SMS_sd_Content, "GPS");
                    }
                    else if(GpsStatus.Position_Moule_Status == 3)
                    {
                        strcat(SMS_Service.SMS_sd_Content, "BD+GPS");
                    }
                    strcat(SMS_Service.SMS_sd_Content, "#"); // 分隔符号
                    sprintf(SMS_Service.SMS_sd_Content + strlen(SMS_Service.SMS_sd_Content), "%d", ModuleSQ);

                    break;
                case '3':  // 省域ID  市域ID
                    strcat(SMS_Service.SMS_sd_Content, "#provinceid("); // 分隔符号
                    sprintf(SMS_Service.SMS_sd_Content + strlen(SMS_Service.SMS_sd_Content), "%d", Vechicle_Info.Dev_ProvinceID);
                    strcat(SMS_Service.SMS_sd_Content, ")#"); // 分隔符号
                    strcat(SMS_Service.SMS_sd_Content, "cityid("); // 分隔符号
                    sprintf(SMS_Service.SMS_sd_Content + strlen(SMS_Service.SMS_sd_Content), "%d)", Vechicle_Info.Dev_CityID);
                    strcat(SMS_Service.SMS_sd_Content, "#Online("); // 分隔符号
                    sprintf(SMS_Service.SMS_sd_Content + strlen(SMS_Service.SMS_sd_Content), "%d)", DataLink_Status());
                    strcat(SMS_Service.SMS_sd_Content, "#HWver("); // 分隔符号
                    sprintf(SMS_Service.SMS_sd_Content + strlen(SMS_Service.SMS_sd_Content), "%d)", HardWareVerion);
                    break;
                case '4': 		 //速度 传感器
                    strcat(SMS_Service.SMS_sd_Content, "#SpdType("); // 分隔符号
                    sprintf(SMS_Service.SMS_sd_Content + strlen(SMS_Service.SMS_sd_Content), "%d)", JT808Conf_struct.Speed_GetType);
                    strcat(SMS_Service.SMS_sd_Content, "#Adjust("); // 分隔符号
                    sprintf(SMS_Service.SMS_sd_Content + strlen(SMS_Service.SMS_sd_Content), "%d)", JT808Conf_struct.DF_K_adjustState);
                    strcat(SMS_Service.SMS_sd_Content, "#PlusNum("); // 分隔符号
                    sprintf(SMS_Service.SMS_sd_Content + strlen(SMS_Service.SMS_sd_Content), "%d)", JT808Conf_struct.Vech_Character_Value);
                    break;
                case '5':
                    strcat(SMS_Service.SMS_sd_Content, "#gpsspd("); // 分隔符号
                    sprintf(SMS_Service.SMS_sd_Content + strlen(SMS_Service.SMS_sd_Content), "%d km/h)", Speed_gps / 10);
                    strcat(SMS_Service.SMS_sd_Content, "#sensor("); // 分隔符号
                    sprintf(SMS_Service.SMS_sd_Content + strlen(SMS_Service.SMS_sd_Content), "%d km/h)", Speed_cacu / 10);

                    break;
                }

