nathanlnw/tw7o5_smsmodem/bsp/stm32f207VC_tw705/app_712/gsm/SMS.c
                if(ACKstate)
                    SMS_Service.SMS_sendFlag = 1; // 发送返回短息标志位
            }
            else if(strncmp(pstrTemp, "ISP", 3) == 0)				///15.远程下载IP 端口
            {
                ;
                Add_SMS_Ack_Content(sms_ack_data, ACKstate);
            }
            else if(strncmp(pstrTemp, "PLATENUM", 8) == 0)
            {
                //rt_kprintf("车牌号:%s", sms_content);
                memset((u8 *)&Vechicle_Info.Vech_Num, 0, sizeof(Vechicle_Info.Vech_Num));	//clear
                rt_memcpy(Vechicle_Info.Vech_Num, sms_content, strlen(sms_content));
                DF_WriteFlashSector(DF_Vehicle_Struct_offset, 0, (u8 *)&Vechicle_Info, sizeof(Vechicle_Info));
                WatchDog_Feed();
                DF_WriteFlashSector(DF_VehicleBAK_Struct_offset, 0, (u8 *)&Vechicle_Info, sizeof(Vechicle_Info));

                WatchDog_Feed();
                DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset, 0, (u8 *)&Vechicle_Info, sizeof(Vechicle_Info));

                Add_SMS_Ack_Content(sms_ack_data, ACKstate);

                Login_Menu_Flag = 1;	 // clear  first flag
                DF_WriteFlashSector(DF_LOGIIN_Flag_offset, 0, &Login_Menu_Flag, 1);

                //--------    清除鉴权码 -------------------
                idip("clear");
            }
            else if(strncmp(pstrTemp, "COLOUR", 6) == 0)
            {
                j = sscanf(sms_content, "%d", &u16Temp);
                if(j)
                {

                    Vechicle_Info.Dev_Color = u16Temp;
                    //rt_kprintf("\r\n 车辆颜色: %s ,%d \r\n",sms_content,Vechicle_Info.Dev_Color);
                    DF_WriteFlashSector(DF_Vehicle_Struct_offset, 0, (u8 *)&Vechicle_Info, sizeof(Vechicle_Info));

                    WatchDog_Feed();
                    DF_WriteFlashSector(DF_VehicleBAK_Struct_offset, 0, (u8 *)&Vechicle_Info, sizeof(Vechicle_Info));

                    WatchDog_Feed();
                    DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset, 0, (u8 *)&Vechicle_Info, sizeof(Vechicle_Info));
                    Add_SMS_Ack_Content(sms_ack_data, ACKstate);
                }
            }
            else if(strncmp(pstrTemp, "CONNECT", 6) == 0)
            {
                j = sscanf(sms_content, "%d", &u16Temp);
                if(j)
                {

                    Vechicle_Info.Link_Frist_Mode = u16Temp;
                    //rt_kprintf("\r\n 首次连接方式 %s ,%d \r\n",sms_content,Vechicle_Info.Link_Frist_Mode);
                    DF_WriteFlashSector(DF_Vehicle_Struct_offset, 0, (u8 *)&Vechicle_Info, sizeof(Vechicle_Info));

                    WatchDog_Feed();
                    DF_WriteFlashSector(DF_VehicleBAK_Struct_offset, 0, (u8 *)&Vechicle_Info, sizeof(Vechicle_Info));

                    WatchDog_Feed();
                    DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset, 0, (u8 *)&Vechicle_Info, sizeof(Vechicle_Info));
                    Add_SMS_Ack_Content(sms_ack_data, ACKstate);
                    //--------    清除鉴权码 -------------------
                    idip("clear");
                }
            }
            else if(strncmp(pstrTemp, "CLEARREGIST", 11) == 0)
            {
                //--------    清除鉴权码 -------------------
                idip("clear");
                DEV_regist.Enable_sd = 1; // set 发送注册标志位
                DataLink_EndFlag = 1;
                Add_SMS_Ack_Content(sms_ack_data, ACKstate); //  ack  state
            }
            //  20
            else if(strncmp(pstrTemp, "PASSWORD", 8) == 0) //设置密码通过
            {
                j = sscanf(sms_content, "%d", &u16Temp);
                if(j)
                {
                    Login_Menu_Flag = (u8)u16Temp;	 // clear  first flag
                    DF_WriteFlashSector(DF_LOGIIN_Flag_offset, 0, &Login_Menu_Flag, 1);

                    Add_SMS_Ack_Content(sms_ack_data, ACKstate); //  ack  state
                    if(Login_Menu_Flag)
                    {
                        //--------    清除鉴权码 -------------------
                        idip("clear");
                        DEV_regist.Enable_sd = 1; // set 发送注册标志位
                        DataLink_EndFlag = 1;
                    }
                }
            }
            else if(strncmp(pstrTemp, "RECOVER", 7) == 0)
            {
                //------  界面回复出厂设置
                Login_Menu_Flag = 0;	 // clear	first flag
                DF_WriteFlashSector(DF_LOGIIN_Flag_offset, 0, &Login_Menu_Flag, 1);

                Add_SMS_Ack_Content(sms_ack_data, ACKstate); //  ack  state
                Systerm_Reset_counter = Max_SystemCounter - 30; //返回短信后恢复出厂设置

            } //provinceid
            else if(strncmp(pstrTemp, "PROVINCEID", 10) == 0)
            {
                provinceid(sms_content);
                Add_SMS_Ack_Content(sms_ack_data, ACKstate);

            }
            else if(strncmp(pstrTemp, "CITYID", 6) == 0)
            {
                cityid(sms_content);
                Add_SMS_Ack_Content(sms_ack_data, ACKstate);

            }
            else if(strncmp(pstrTemp, "ATAENABLE", 9) == 0)
            {
                j = sscanf(sms_content, "%d", &u16Temp);
                if(j)
                {
                    ata_enable(u16Temp);
                    Add_SMS_Ack_Content(sms_ack_data, ACKstate);
                }

            }
            else if(strncmp(pstrTemp, "TYPEVECH", 8) == 0)			///14.车辆状态查询
            {
                if(sms_content[0] == '1')
                {
                    type_vech(1);
                    Add_SMS_Ack_Content(sms_ack_data, ACKstate);
                }
                if(sms_content[0] == '2')
                {
                    type_vech(2);
                    Add_SMS_Ack_Content(sms_ack_data, ACKstate);
                }
            }

            if(strncmp(pstrTemp, "PROTYPE", 7) == 0)			 ///设置终端型号
            {
                rt_kprintf("\r\n	PROTYPE \r\n");
                switch(sms_content[0])
                {
                case '3':
                    product_type("TW703");
                    Add_SMS_Ack_Content(sms_ack_data, ACKstate);
                    break;
                case  '5':
                    product_type("TW705");
                    Add_SMS_Ack_Content(sms_ack_data, ACKstate);
                    break;
                default:
                    break;
                }
            }

            if(strncmp(pstrTemp, "SPDTYPE", 6) == 0)
            {
                j = sscanf(sms_content, "%d", &u16Temp);
                if(j)
                {
                    spd_type(u16Temp);//   0: GPS 速度   1:  传感器速度
                    Add_SMS_Ack_Content(sms_ack_data, ACKstate);

