nathanlnw/tw7o5_smsmodem/bsp/stm32f207VC_tw705/app_712/gsm/SMS.c
                }
            }
            else if(strncmp(pstrTemp, "ADJUST", 6) == 0)
            {
                j = sscanf(sms_content, "%d", &u16Temp);
                if(j)
                {
                    adjust_ok(u16Temp);//   0: GPS 速度   1:  传感器速度
                    Add_SMS_Ack_Content(sms_ack_data, ACKstate);

                }
            }
            else if(strncmp(pstrTemp, "PLUSNUM", 6) == 0)
            {
                j = sscanf(sms_content, "%d", &u16Temp);
                if(j)
                {
                    plus_num(u16Temp);//	0: GPS 速度   1:  传感器速度
                    Add_SMS_Ack_Content(sms_ack_data, ACKstate);

                }
            }
            else if(strncmp(pstrTemp, "DATACLEAR", 9) == 0)		///清除存储数据
            {
                write_read(0, 0);
                Add_SMS_Ack_Content(sms_ack_data, ACKstate);
            }
            else if(strncmp(pstrTemp, "PLAYSET", 7) == 0)				///3. 修改发送间隔
            {
                j = sscanf(sms_content, "%u", &u16Temp);
                if(j)
                {
                    Warn_Play_controlBit = j;
                    DF_WriteFlashSector(DF_WARN_PLAY_Page, 0, &Warn_Play_controlBit, 1);
                    Add_SMS_Ack_Content(sms_ack_data, ACKstate);
                }
            }
            //-----------------------------------------------------------------------------------
        }
        else
        {
            break;
        }

    }
}



/*********************************************************************************
*函数名称:u8 SMS_Rx_Text(char *instr,char *strDestNum)
*功能描述:接收到TEXT格式的短信处理函数
*输    入:instr 原始短信数据，strDestNum接收到得信息的发送方号码
*输    出:none
*返 回 值:	1:正常完成，
			0:表示失败
*作    者:白养民
*创建日期:2013-05-29
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
u8 SMS_Rx_Text(char *instr, char *strDestNum)
{
    u16 len;
    u8 ret = 0;
    len = strlen(strDestNum);
    memset( SMS_Service.SMS_destNum, 0, sizeof( SMS_Service.SMS_destNum ) );
    if(len > sizeof( SMS_Service.SMS_destNum ))
    {
        len = sizeof( SMS_Service.SMS_destNum );
    }
    memcpy(SMS_Service.SMS_destNum, strDestNum, len);
    rt_kprintf( "\r\n Rx_Text 短息来源号码:%s", SMS_Service.SMS_destNum ); 

    len = strlen(instr);
    rt_kprintf( "\r\n 短信收到消息: " );
    rt_device_write( &dev_vuart, 0, instr, len);

    //  tw705 回复的就是 TW705  收到703 也回705
    if(( strncmp( (char *)instr, "TW705#", 6 ) == 0 ) || ( strncmp( (char *)instr, "TW703#", 6 ) == 0 ))                                            //短信修改UDP的IP和端口
    {
        //-----------  自定义 短息设置修改 协议 ----------------------------------
        SMS_protocol( instr + 5, len - 5 , SMS_ACK_msg);
        ret = 1;
    }
    SMS_Service.SMS_read		= 0;
    SMS_Service.SMS_waitCounter = 0;
    SMS_Service.SMS_come		= 0;
    //SMS_Service.SMS_delALL		= 1;
    return ret;
}


/*********************************************************************************
*函数名称:u8 SMS_Rx_PDU(char *instr,u16 len)
*功能描述:接收到PDU格式的短信处理函数
*输    入:instr 原始短信数据，len接收到得信息长度，单位为字节
*输    出:none
*返 回 值:	1:正常完成，
			0:表示失败
*作    者:白养民
*创建日期:2013-05-29
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
u8 SMS_Rx_PDU(char *instr, u16 len)
{
    char *pstrTemp;
    u8 ret = 0;

    //////
    memset( SMS_Service.SMS_destNum, 0, sizeof( SMS_Service.SMS_destNum ) );
    pstrTemp = (char *)rt_malloc(200);	///短信解码后的完整内容，解码后汉子为GB码
    memset(pstrTemp, 0, 200);
    if(GB19056.workstate==3)
    {
        rt_kprintf( "\r\n 短信原始消息: " );
        rt_device_write( &dev_vuart, 0, GSM_rx, len );
    }

    len = GsmDecodePdu(GSM_rx, len, &SMS_Service.Sms_Info, pstrTemp);
    GetPhoneNumFromPDU( SMS_Service.SMS_destNum,  SMS_Service.Sms_Info.TPA, sizeof(SMS_Service.Sms_Info.TPA));

    //memcpy( SMS_Service.SMS_destNum, SMS_Service.Sms_Info.TPA,sizeof( SMS_Service.SMS_destNum ) );
    // if(GB19056.workstate)
    {   
		rt_kprintf( "\r\n        收到短消息! ");
        rt_kprintf( "\r\n                来源号码:%s \r\n", SMS_Service.SMS_destNum );
        rt_kprintf( "\r\n                消息内容:" );
        rt_device_write( &dev_vuart, 0, pstrTemp, len );
		rt_kprintf( "\r\n  ");
    }
    //rt_hw_console_output(GSM_rx);
    //  短息接收处理---------------- 
    /*
    if(( strncmp( (char *)pstrTemp, "TW705#", 6 ) == 0 ) || ( strncmp( (char *)pstrTemp, "TW703#", 6 ) == 0 ))                                            //短信修改UDP的IP和端口
    {
        //-----------  自定义 短息设置修改 协议 ----------------------------------
        SMS_protocol( pstrTemp + 5, len - 5 , SMS_ACK_msg);
        ret = 1;
    }*/
     
	ret = 1;
    SMS_Service.SMS_read		= 0;
    SMS_Service.SMS_waitCounter = 3;
    SMS_Service.SMS_come		= 1;
    //SMS_Service.SMS_delALL		= 1;
    rt_free( pstrTemp );
    pstrTemp = RT_NULL;
    return ret;
}


void sms_dest(u8 *str) 
{

    u8 i = 0, value = 0;
    u8 reg_str[20];

    memset(reg_str, 0, sizeof(reg_str));
    if (strlen((const char *)str) == 0)
    {
        rt_kprintf("\r\n 短息目的号码为 : ");
        for(i = 0; i < 11; i++)
            rt_kprintf("%c", SMS_Destion[i]);
        rt_kprintf("\r\n");
        return ;
    }
    else
    {
        //---- check -------
        memcpy(reg_str, str, strlen((const char *)str));
        if(strlen((const char *)reg_str) == 11) //  长度判断
        {
            for(i = 0; i < 11; i++)
            {
                if(!((reg_str[i] >= '0') && (reg_str[i] <= '9')))
                {
                    value = 1;
                    break;
                }
            }

            if(value)
            {
                rt_kprintf("\r\ndevice_ContentError\r\n");
                rt_kprintf("\r\n 短息目的号码不合法!  \r\n");
                return ;
            }

        }
        else
        {
            rt_kprintf("\r\ndevice_LenError\r\n");
            rt_kprintf("\r\n 短息目的号码长度不正确!  \r\n"); 
            return ;
        }

        memset(SMS_Destion, 0, sizeof(SMS_Destion));
        memcpy(SMS_Destion, reg_str, 11);
        DF_WriteFlashSector(DF_DeviceID_offset, 0, SMS_Destion, 13);
        delay_ms(80);
        DF_ReadFlash(DF_DeviceID_offset, 0, SMS_Destion, 13);
        rt_kprintf("\r\ndevice_OK(");
        for(i = 0; i < 11; i++)
            rt_kprintf("%c", SMS_Destion[i]);
        rt_kprintf(")\r\n");
        rt_kprintf("\r\n短息目的号码为 :%s\r\n", SMS_Destion);
        rt_kprintf("\r\n");
        return ;
    }
}
FINSH_FUNCTION_EXPORT(sms_dest, sms_destnum set);

void txt_sms(u8 *str)
{
   u8 local_str[150];
   u8  len=0;

