nathanlnw/tw7o5_smsmodem/bsp/stm32f207VC_tw705/app_712/gsm/SMS.c
   memset(local_str,0,sizeof(local_str));
   strcat((char *)local_str, str);
   len=strlen(local_str);
   
   if(11!=strlen(SMS_Destion))
  {	 
	   rt_kprintf("\r\n 短息号码错误，请输入11 位手机号码\r\n", str);
       
      return;
  }
   if(len>70)
  {	 
	   rt_kprintf("\r\n  信息内容过长，请输入小于等于70个字符\r\n", str);
       
      return;
  }
   memset(SMS_Service.SMS_destNum,0,sizeof(SMS_Service.SMS_destNum)); 
   memcpy(SMS_Service.SMS_destNum,SMS_Destion,strlen(SMS_Destion));
   SMS_Service.SMS_come=1;
   memset(SMS_Service.SMS_sd_Content, 0, sizeof(SMS_Service.SMS_sd_Content));
   strcat((char *)SMS_Service.SMS_sd_Content, str);
   SMS_Service.SMS_sendFlag = 1;


   rt_kprintf("\r\n            短息目的号码为 :%s\r\n", SMS_Destion); 
   rt_kprintf("\r\n            发送信息内容为 :%s\r\n", str);

}
FINSH_FUNCTION_EXPORT(txt_sms, txt_sms); 


#if 0
u8 SMS_Tx_Text(char *strDestNum, char *s)
{
    u16 len;
    char *pstrTemp;

    memset(SMS_Service.SMSAtSend, 0, sizeof(SMS_Service.SMSAtSend));
    strcpy( ( char * ) SMS_Service.SMSAtSend, "AT+CMGS=\"" );
    //strcat(SMS_Service.SMSAtSend,"8613820554863");// Debug
    strcat(SMS_Service.SMSAtSend, strDestNum);
    strcat(SMS_Service.SMSAtSend, "\"\r\n");

    rt_kprintf("\r\n%s", SMS_Service.SMSAtSend);
    rt_hw_gsm_output( ( char * ) SMS_Service.SMSAtSend );

    rt_thread_delay(50);

    pstrTemp = rt_malloc(150);
    memset(pstrTemp, 0, 150);
    len = strlen(s);
    memcpy(pstrTemp, s, len);
    pstrTemp[len++] = 0x1A;    // message  end

    ///发送调试信息
    rt_device_write( &dev_vuart, 0, pstrTemp, len);
    ///发送到GSM模块
    rt_hw_gsm_output_Data(pstrTemp, len);
    rt_free( pstrTemp );
    pstrTemp = RT_NULL;
    return 1;
}
//FINSH_FUNCTION_EXPORT(SMS_Tx_Text, SMS_Tx_Text);



u8 SMS_Tx_PDU(char *strDestNum, char *s)
{
    u16 len;
    u16 i;
    char *pstrTemp;
    memset(SMS_Service.SMSAtSend, 0, sizeof(SMS_Service.SMSAtSend));
    pstrTemp = rt_malloc(400);
    memset(pstrTemp, 0, 400);
    i = 0;
    SetPhoneNumToPDU(SMS_Service.Sms_Info.TPA, strDestNum, sizeof(SMS_Service.Sms_Info.TPA));
    len = AnySmsEncode_NoCenter(SMS_Service.Sms_Info.TPA, GSM_UCS2, s, strlen(s), pstrTemp);
    //len=strlen(pstrTemp);
    pstrTemp[len++] = 0x1A;    // message  end
    //////
    sprintf( ( char * ) SMS_Service.SMSAtSend, "AT+CMGS=%d\r\n", (len - 2) / 2);
    rt_kprintf("%s", SMS_Service.SMSAtSend);
    rt_hw_gsm_output( ( char * ) SMS_Service.SMSAtSend );
    rt_thread_delay(50);
    //////
    rt_device_write( &dev_vuart, 0, pstrTemp, strlen(pstrTemp) );
    //rt_hw_console_output(pstrTemp);
    rt_hw_gsm_output_Data(pstrTemp, len);
    rt_free( pstrTemp );
    pstrTemp = RT_NULL;
    return 1;
}
//FINSH_FUNCTION_EXPORT(SMS_Tx_PDU, SMS_Tx_PDU);

#endif

/*********************************************************************************
*函数名称:u8 SMS_Rx_Notice(u16 indexNum)
*功能描述:模块收到新短信通知
*输    入:新短信的索引号
*输    出:none
*返 回 值:	1:正常完成，
			0:表示失败
*作    者:白养民
*创建日期:2013-05-29
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
u8 SMS_Rx_Notice(u16 indexNum)
{
    SMS_Service.SMIndex = indexNum;
    if(GB19056.workstate)
        rt_kprintf( " index=%d", SMS_Service.SMIndex );
    SMS_Service.SMS_read		= 3;
    SMS_Service.SMS_waitCounter = 1;
    return 1;
}

